Revit 2026 API

# ViewPlanAreaScheme Property

---

The area scheme.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AreaScheme AreaScheme { get; }
```
```vb
Public ReadOnly Property AreaScheme As AreaScheme
	Get
```
```cpp
public:
property AreaScheme^ AreaScheme {
	AreaScheme^ get ();
}
```
```fsharp
member AreaScheme : AreaScheme with get
```

#### Property Value

AreaSchemeReturns  if this plan view is not an area plan.

#### Reference

ViewPlan Class

Autodesk.Revit.DB Namespace